app/Http/Helpers.php

select * from `product_stocks` where `product_stocks`.`id` = 1583 limit 1
---
  function home_base_price_by_stock_id($id)
  {
    $product_stock = ProductStock::findOrFail($id);

select * from `product_stocks` where `product_stocks`.`id` = 1583 limit 1
---
  function home_discounted_base_price_by_stock_id($id)
  {
    $product_stock = ProductStock::findOrFail($id);

select * from `uploads` where `uploads`.`id` = '9312' limit 1
---
  function uploaded_asset($id)
  {
    if (($asset = \App\Models\Upload::find($id)) != null) {

select * from `business_settings`
---
  function get_setting($key, $default = null, $lang = false)
  {
    $settings = Cache::remember('business_settings', 86400, function () {
      return BusinessSetting::all();
    });

select * from `addons`
---
  function addon_is_activated($identifier, $default = null)
  {
    $addons = Cache::remember('addons', 86400, function () {
      return Addon::all();
    });