app/Http/Controllers/AdminController.php

select * from `categories` where `level` = 0
---
    public function admin_dashboard(Request $request)
    {
        CoreComponentRepository::initializeCache();
        $root_categories = Category::where('level', 0)->get();