app/Http/Controllers/HomeController.php

    public function all_brands(Request $request)
    {
        $categories = Category::all();
---
select * from `categories`

    public function get_category_items(Request $request)
    {
        $category = Category::findOrFail($request->id);
---
select * from `categories` where `categories`.`id` = '4' limit 1

    public function all_flash_deals()
    {
        $today = strtotime(date('Y-m-d H:i:s'));

        $data['all_flash_deals'] = FlashDeal::where('status', 1)
            ->where('start_date', "<=", $today)
            ->where('end_date', ">", $today)
            ->orderBy('created_at', 'desc')
            ->get();
---
select * from `flash_deals` where `status` = 1 and `start_date` <= 1772639851 and `end_date` > 1772639851 order by `created_at` desc